burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_rtc.c
/*!
    \file    gd32w51x_f5hc_rtc.c
    \brief   RTC driver

    \version 2026-04-15, V2.0.0, firmware for gd32w51x_f5hc
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/
#include "gd32w51x_f5hc_rtc.h"

/* RTC timeout value */
#define RTC_WTWF_TIMEOUT                    ((uint32_t)0x00004000U)                     /*!< wakeup timer can be written flag timeout */
#define RTC_INITM_TIMEOUT                   ((uint32_t)0x00004000U)                     /*!< initialization state flag timeout */
#define RTC_RSYNF_TIMEOUT                   ((uint32_t)0x0000A000U)                     /*!< register synchronization flag timeout */
#define RTC_HRFC_TIMEOUT                    ((uint32_t)0x20000000U)                     /*!< recalibration pending flag timeout */
#define RTC_SHIFTCTL_TIMEOUT                ((uint32_t)0x00001000U)                     /*!< shift function operation pending flag timeout */
#define RTC_ALRMXWF_TIMEOUT                 ((uint32_t)0x00008000U)                     /*!< alarm configuration can be written flag timeout */

/* RTC alarm subsecond mask definitions */
#define RTC_ALRMSS_MASK_SUBSECOND_MASK      ((uint32_t)0x0F000000U)                      /*!< alarm subsecond mask field mask */
#define RTC_ALRMSS_SUBSECOND_MASK           ((uint32_t)0x00007FFFU)                     /*!< alarm subsecond value field mask */
/* RTC backup registers secure protection zone mask definitions */
#define RTC_SPM_CTL_BKPRWSECP_MASK          ((uint32_t)0x00FF0000U)                     /*!< backup registers zone a secure protection mask */
#define RTC_SPM_CTL_BKPWSECP_MASK           ((uint32_t)0xFF000000U)                     /*!< backup registers zone b secure protection mask */
#define RTC_PRI_PRO_MASK                    ((uint32_t)0xC000F00FU)                    /* rtc privilege protection mask */
#define RTC_SEC_PRO_MASK                    ((uint32_t)0x0000F00FU)                    /* rtc secure protection mask */
/*!
    \brief      reset most of the RTC registers (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_deinit(void)
{
    /* After Backup domain reset, some of the RTC registers are write-protected: RTC_TIME, RTC_DATE, RTC_PSC,
       RTC_HRFC, RTC_COSC, RTC_SHIFTCTL, the bit INITM in RTC_ICS and the bits CS, S1H, A1H, REFEN in RTC_CTL. */
    ErrStatus error_status = ERROR;
    volatile uint32_t time_index = RTC_WTWF_TIMEOUT;
    uint32_t flag_status = RESET;
    /* RTC_TAMP register is not under write protection */
    RTC_TAMP = RTC_REGISTER_RESET;

    /* rtc alarmx related registers are not under the protection of RTC_WPK, different from former GD32MCU */
    RTC_CTL &= ((uint32_t)~(RTC_CTL_ALRM0EN | RTC_CTL_ALRM1EN));
    /* to write RTC_ALRMxTD and RTC_ALRMxSS register, 1  ALRMxEN bit in RTC_CTL register should be reset as the condition
      2 or in INIT mode */
    RTC_ALRM0TD = RTC_REGISTER_RESET;
    RTC_ALRM1TD = RTC_REGISTER_RESET;
    RTC_ALRM0SS = RTC_REGISTER_RESET;
    RTC_ALRM1SS = RTC_REGISTER_RESET;

    /* 1 only when RTC_CTL_WTEN=0 and RTC_ICS_WTWF=1 can write RTC_CTL[2:0]
       2 or configure the wakeup timer in INIT mode*/
    RTC_CTL &= ((uint32_t)~RTC_CTL_WTEN);
    /* wait until the WTWF flag to be set */
    do {
        flag_status = RTC_ICS & RTC_ICS_WTWF;
    } while((--time_index > 0U) && ((uint32_t)RESET == flag_status));

    if((uint32_t)RESET == flag_status) {
        error_status = ERROR;
    } else {
        RTC_CTL &= ((uint32_t)~RTC_CTL_WTCS);
        RTC_WUT = RTC_WUT_RESET;

        /* disable the write protection */
        RTC_WPK = RTC_UNLOCK_KEY1;
        RTC_WPK = RTC_UNLOCK_KEY2;

        /* enter INIT mode */
        error_status = rtc_init_mode_enter();
        /* RTC_TIME, RTC_DATE, RTC_PSC registers, plus INITM in RTC_ICS, plus CS control bits in RTC_CTL */
        RTC_CTL = RTC_REGISTER_RESET;

        /* before reset RTC_TIME and RTC_DATE, BPSHAD bit in RTC_CTL should be reset as the condition.
           in order to read calendar from shadow register, not the real registers being reset */
        RTC_TIME = RTC_REGISTER_RESET;
        RTC_DATE = RTC_DATE_RESET;
        RTC_PSC = RTC_PSC_RESET;
        /* write protected and can only be written in initialization state */
        RTC_COSC = RTC_REGISTER_RESET;
        /* reset RTC_ICS register, also exit INIT mode.
           at the same time, RTC_ICS_SOPF bit is reset, as the condition to reset RTC_SHIFTCTL register later */
        RTC_ICS = RTC_ICS_RESET;
        /* reset RTC_SHIFTCTL and RTC_HRFC register, and the bits S1H, A1H, REFEN in RTC_CTL, these can be done without the INIT mode */
        RTC_SHIFTCTL = RTC_REGISTER_RESET;
        RTC_HRFC = RTC_REGISTER_RESET;

        error_status = rtc_register_sync_wait();

        /* enable the write protection */
        RTC_WPK = RTC_LOCK_KEY;

        RTC_PPM_CTL = RTC_REGISTER_RESET;
        RTC_SPM_CTL = RTC_SPM_CTL_RESET;
        RTC_STATC = (RTC_STATC_ALRM0FC | RTC_STATC_ALRM1FC | RTC_STATC_WTFC | RTC_STATC_TSFC | RTC_STATC_TSOVRFC | RTC_STATC_TP0FC | RTC_STATC_TP1FC);
    }
    return error_status;
}

/*!
    \brief      initialize RTC registers (API_ID(0x0002U))
    \param[in]  rtc_initpara_struct: pointer to a rtc_parameter_struct structure which contains
                parameters for initialization of the rtc peripheral
                members of the structure and the member values are shown as below:
                  year: 0x0 - 0x99(BCD format)
                  month: RTC_JAN, RTC_FEB, RTC_MAR, RTC_APR, RTC_MAY, RTC_JUN,
                             RTC_JUL, RTC_AUG, RTC_SEP, RTC_OCT, RTC_NOV, RTC_DEC
                  date: 0x1 - 0x31(BCD format)
                  day_of_week: RTC_MONDAY, RTC_TUESDAY, RTC_WEDNESDAY, RTC_THURSDAY
                                   RTC_FRIDAY, RTC_SATURDAY, RTC_SUNDAY
                  hour: 0x0 - 0x12(BCD format) or 0x0 - 0x23(BCD format) depending on the rtc display_format chose
                  minute: 0x0 - 0x59(BCD format)
                  second: 0x0 - 0x59(BCD format)
                  factor_asyn: 0x0 - 0x7F
                  factor_syn: 0x0 - 0x7FFF
                  am_pm: RTC_AM, RTC_PM
                  display_format: RTC_24HOUR, RTC_12HOUR
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_init(rtc_parameter_struct *rtc_initpara_struct)
{
    ErrStatus error_status = ERROR;
    uint32_t reg_time = 0U, reg_date = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(rtc_initpara_struct)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg_date = (DATE_YR(rtc_initpara_struct->year) | \
                    DATE_DOW(rtc_initpara_struct->day_of_week) | \
                    DATE_MON(rtc_initpara_struct->month) | \
                    DATE_DAY(rtc_initpara_struct->date));

