burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_rtc.c
            RTC_TAMP |= (uint32_t)(rtc_tamper->tamper_sample_frequency);
            RTC_TAMP |= (uint32_t)(rtc_tamper->tamper_filter);

            /* configure the tamper trigger */
            RTC_TAMP &= ((uint32_t)~((rtc_tamper->tamper_source) << RTC_TAMPER_TRIGGER_POS));
            if(RTC_TAMPER_TRIGGER_LEVEL_LOW != rtc_tamper->tamper_trigger) {
                RTC_TAMP |= (uint32_t)((rtc_tamper->tamper_source) << RTC_TAMPER_TRIGGER_POS);
            }
        } else {
            /* configure the tamper trigger */
            RTC_TAMP &= ((uint32_t)~((rtc_tamper->tamper_source) << RTC_TAMPER_TRIGGER_POS));
            if(RTC_TAMPER_TRIGGER_EDGE_RISING != rtc_tamper->tamper_trigger) {
                RTC_TAMP |= (uint32_t)((rtc_tamper->tamper_source) << RTC_TAMPER_TRIGGER_POS);
            }
        }
        RTC_TAMP &= (uint32_t)~RTC_TAMP_TPTS;
        if(DISABLE != rtc_tamper->tamper_with_timestamp) {
            /* the tamper event also cause a time-stamp event */
            RTC_TAMP |= (uint32_t)RTC_TAMP_TPTS;
        }
        /* enable tamper */
        RTC_TAMP |= (uint32_t)(rtc_tamper->tamper_source);
    }
}

/*!
    \brief      disable RTC tamper (API_ID(0x0013U))
    \param[in]  source: specify which tamper source to be disabled
      \arg        RTC_TAMPER0
      \arg        RTC_TAMPER1
    \param[out] none
    \retval     none
*/
void rtc_tamper_disable(uint32_t source)
{
    /* disable tamper */
    RTC_TAMP &= (uint32_t)~(source & (RTC_TAMP_TP0EN | RTC_TAMP_TP1EN));

}

/*!
    \brief      reset the RTC_BKP registers by sofware (API_ID(0x0014U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rtc_software_bkp_reset(void)
{
    RTC_TAMP |= RTC_TAMP_BKERASE;
}

/*!
    \brief      tamper event does not erase the RTC_BKP registers (API_ID(0x0015U))
    \param[in]  ne_source: specify which tamper source will not trigger the RTC_BKP registers reset
      \arg        RTC_TAMPXNOER_NONE: both tamper0 and tamper1 event will trigger RTC_BKP registers reset
      \arg        RTC_TAMPXNOER_TP0: tamper0 event will not trigger RTC_BKP registers reset
      \arg        RTC_TAMPXNOER_TP1: tamper1 event will not trigger RTC_BKP registers reset
      \arg        RTC_TAMPXNOER_TP0_TP1: Neither tamper0 nor tamepr1 event will trigger RTC_BKP registers reset
    \param[out] none
    \retval     none
*/
void rtc_tamper_without_bkp_reset(uint32_t ne_source)
{
    RTC_TAMP &= (uint32_t)~(RTC_TAMP_TP0NOER | RTC_TAMP_TP1NOER);
    RTC_TAMP |= (ne_source & (RTC_TAMP_TP0NOER | RTC_TAMP_TP1NOER));
}

/*!
    \brief      select the RTC output pin (API_ID(0x0016U))
    \param[in]  outputpin: specify the rtc output pin is PC15 or PA3/PA8
      \arg        RTC_OUT_PC15: the rtc output pin is PC15
      \arg        RTC_OUT_PA3_PA8: the rtc output pin is PA3 or PA8 according to the AFIO configuration
    \param[out] none
    \retval     none
*/
void rtc_output_pin_select(uint32_t outputpin)
{
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    RTC_CTL &= (uint32_t)~(RTC_CTL_OUT2EN);
    RTC_CTL |= (uint32_t)(outputpin);

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}

/*!
    \brief      configure rtc alarm output source (API_ID(0x0017U))
    \param[in]  source: specify signal to output
      \arg        RTC_ALARM0_HIGH: when the alarm0 flag is set, the output pin is high
      \arg        RTC_ALARM0_LOW: when the alarm0 flag is set, the output pin is low
      \arg        RTC_ALARM1_HIGH: when the alarm1 flag is set, the output pin is high
      \arg        RTC_ALARM1_LOW: when the alarm1 flag is set, the output pin is low
      \arg        RTC_WAKEUP_HIGH: when the wakeup flag is set, the output pin is high
      \arg        RTC_WAKEUP_LOW: when the wakeup flag is set, the output pin is low
    \param[in]  mode: specify the output pin mode when output alarm signal or auto wakeup signal
      \arg        RTC_ALARM_OUTPUT_OD: open drain mode
      \arg        RTC_ALARM_OUTPUT_PP: push pull mode
    \param[out] none
    \retval     none
*/
void rtc_alarm_output_config(uint32_t source, uint32_t mode)
{
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    RTC_CTL &= ~(RTC_CTL_OS | RTC_CTL_OPOL);
    RTC_TAMP &= ~RTC_TAMP_AOT;

    RTC_CTL |= (uint32_t)(source & (RTC_CTL_OS | RTC_CTL_OPOL));
    /* alarm output */
    RTC_TAMP |= (uint32_t)(mode & ((RTC_CTL_OS | RTC_CTL_OPOL)));

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}

/*!
    \brief      configure rtc calibration output source (API_ID(0x0018U))
    \param[in]  source: specify signal to output
      \arg        RTC_CALIBRATION_512HZ: when the LXTAL freqency is 32768Hz and the RTC_PSC
                                         is the default value, output 512Hz signal
      \arg        RTC_CALIBRATION_1HZ: when the LXTAL freqency is 32768Hz and the RTC_PSC
                                       is the default value, output 1Hz signal
    \param[out] none
    \retval     none
*/
void rtc_calibration_output_config(uint32_t source)
{
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    RTC_CTL &= (uint32_t)~(RTC_CTL_COEN | RTC_CTL_COS);

    RTC_CTL |= (uint32_t)(source & (RTC_CTL_COEN | RTC_CTL_COS));
    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}

/*!
    \brief      adjust the daylight saving time by adding or subtracting one hour from the current time (API_ID(0x0019U))
    \param[in]  operation: hour adjustment operation
      \arg        RTC_CTL_A1H: add one hour
      \arg        RTC_CTL_S1H: substract one hour
    \param[out] none
    \retval     none
*/
void rtc_hour_adjust(uint32_t operation)
{
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    RTC_CTL |= (uint32_t)(operation & (RTC_CTL_A1H | RTC_CTL_S1H));

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}

/*!
    \brief      adjust RTC second or subsecond value of current time (API_ID(0x001AU))
    \param[in]  add: add 1s to current time or not
      \arg        RTC_SHIFT_ADD1S_RESET: no effect
      \arg        RTC_SHIFT_ADD1S_SET: add 1s to current time
    \param[in]  minus: number of subsecond to minus from current time(0x0 - 0x7FFF)
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_second_adjust(uint32_t add, uint32_t minus)
{
    volatile uint32_t time_index = RTC_SHIFTCTL_TIMEOUT;
    ErrStatus error_status = ERROR;
    uint32_t flag_status = RESET;
    uint32_t temp = 0U;

