burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_rtc.c
    if((uint32_t)RESET == flag_status) {
        error_status = ERROR;
    } else {
        RTC_WUT = (uint32_t)wakeup_timer;
        error_status = SUCCESS;
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;

    return error_status;
}

/*!
    \brief      get wakeup timer value (API_ID(0x0023U))
    \param[in]  none
    \param[out] none
    \retval     wakeup timer value
*/
uint16_t rtc_wakeup_timer_get(void)
{
    return (uint16_t)RTC_WUT;
}

/*!
    \brief      configure RTC smooth calibration (API_ID(0x0024U))
    \param[in]  window: select calibration window
      \arg        RTC_CALIBRATION_WINDOW_32S: 2exp20 RTCCLK cycles, 32s if RTCCLK = 32768 Hz
      \arg        RTC_CALIBRATION_WINDOW_16S: 2exp19 RTCCLK cycles, 16s if RTCCLK = 32768 Hz
      \arg        RTC_CALIBRATION_WINDOW_8S: 2exp18 RTCCLK cycles, 8s if RTCCLK = 32768 Hz
    \param[in]  plus: add RTC clock or not
      \arg        RTC_CALIBRATION_PLUS_SET: add one RTC clock every 2048 rtc clock
      \arg        RTC_CALIBRATION_PLUS_RESET: no effect
    \param[in]  minus: the RTC clock to minus during the calibration window(0x0 - 0x1FF)
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_smooth_calibration_config(uint32_t window, uint32_t plus, uint32_t minus)
{
    volatile uint32_t time_index = RTC_HRFC_TIMEOUT;
    ErrStatus error_status = ERROR;
    uint32_t flag_status = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RTC_SMOOTH_CALIB_MINUS(minus)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x0024U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* disable the write protection */
        RTC_WPK = RTC_UNLOCK_KEY1;
        RTC_WPK = RTC_UNLOCK_KEY2;

        /* check if a smooth calibration operation is ongoing */
        do {
            flag_status = RTC_ICS & RTC_ICS_SCPF;
        } while((--time_index > 0U) && ((uint32_t)RESET != flag_status));

        if((uint32_t)RESET == flag_status) {
            RTC_HRFC = (uint32_t)((window & (RTC_HRFC_CWND16 | RTC_HRFC_CWND8)) | (plus & RTC_HRFC_FREQI) | HRFC_CMSK(minus));
            error_status = SUCCESS;
        } else {
            error_status = ERROR;
        }

        /* enable the write protection */
        RTC_WPK = RTC_LOCK_KEY;
    }

    return error_status;
}

/*!
    \brief      enable RTC coarse calibration (API_ID(0x0025U))
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_coarse_calibration_enable(void)
{
    ErrStatus error_status = ERROR;
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;
    /* enter init mode */
    error_status = rtc_init_mode_enter();

    if(ERROR != error_status) {
        RTC_CTL |= (uint32_t)RTC_CTL_CCEN;
        /* exit init mode */
        rtc_init_mode_exit();
    }
    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    return error_status;
}

/*!
    \brief      disable RTC coarse calibration (API_ID(0x0026U))
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_coarse_calibration_disable(void)
{
    ErrStatus error_status = ERROR;
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;
    /* enter init mode */
    error_status = rtc_init_mode_enter();

    if(ERROR != error_status) {
        RTC_CTL &= (uint32_t)~RTC_CTL_CCEN;
        /* exit init mode */
        rtc_init_mode_exit();
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    return error_status;
}

/*!
    \brief      config coarse calibration direction and step (API_ID(0x0027U))
    \param[in]  direction: CALIB_INCREASE or CALIB_DECREASE
    \param[in]  step: 0x00-0x1F
                COSD=0:
                  0x00:+0 PPM
                  0x01:+4 PPM
                  0x02:+8 PPM
                  ....
                  0x1F:+126 PPM
                COSD=1:
                  0x00:-0 PPM
                  0x01:-2 PPM
                  0x02:-4 PPM
                  ....
                  0x1F:-63 PPM
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_coarse_calibration_config(uint8_t direction, uint8_t step)
{
    ErrStatus error_status = ERROR;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RTC_COARSE_CALIB_STEP(step)) {
        fw_debug_report_err(RTC_MODULE_ID, API_ID(0x0027U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable the write protection */
        RTC_WPK = RTC_UNLOCK_KEY1;
        RTC_WPK = RTC_UNLOCK_KEY2;

        /* enter init mode */
        error_status = rtc_init_mode_enter();

        if(ERROR != error_status) {
            if(CALIB_DECREASE == direction) {
                RTC_COSC |= (uint32_t)RTC_COSC_COSD;
            } else {
                RTC_COSC &= (uint32_t)~RTC_COSC_COSD;
            }
            RTC_COSC &= ~RTC_COSC_COSS;
            RTC_COSC |= (uint32_t)((uint32_t)step & 0x1FU);
            /* exit init mode */
            rtc_init_mode_exit();
        }
        /* enable the write protection */
        RTC_WPK = RTC_LOCK_KEY;
    }
    return error_status;
}

/*!
    \brief      enable RTC privilege protection mode (API_ID(0x0028U))
    \param[in]  sub_area: specify which sub area of the RTC module to be protected by the privilege mode
      \arg        RTC_PPM_CTL_ALRM0PRIP: Alarm 0 privilege protection
      \arg        RTC_PPM_CTL_ALRM1PRIP: Alarm 1 privilege protection
      \arg        RTC_PPM_CTL_WUTPRIP: Wakeup timer privilege protection
      \arg        RTC_PPM_CTL_TSPRIP: Timestamp privilege protection
      \arg        RTC_PPM_CTL_TAMPPRIP: Tamper privilege protection (excluding backup registers)
      \arg        RTC_PPM_CTL_CALCPRIP: Shift register, daylight saving, calibration and reference clock privilege protection
      \arg        RTC_PPM_CTL_INITPRIP: Initialization privilege protection
      \arg        RTC_PPM_CTL_RTCPRIP: RTC privilege protection
      \arg        RTC_PPM_CTL_BKPRWPRIP: backup registers zone a privilege protection
      \arg        RTC_PPM_CTL_BKPWPRIP: backup registers zone b privilege protection
    \param[out] none
    \retval     none
*/
void rtc_pri_pro_enable(uint32_t sub_area)
{
    RTC_PPM_CTL |= (sub_area & RTC_PRI_PRO_MASK);
}

/*!
    \brief      disable RTC privilege protection mode (API_ID(0x0029U))
    \param[in]  sub_area: specify which sub area of the RTC module to be removed from the protection of the privilege mode
      \arg        RTC_PPM_CTL_ALRM0PRIP: Alarm 0 privilege protection
      \arg        RTC_PPM_CTL_ALRM1PRIP: Alarm 1 privilege protection
      \arg        RTC_PPM_CTL_WUTPRIP: Wakeup timer privilege protection
      \arg        RTC_PPM_CTL_TSPRIP: Timestamp privilege protection
      \arg        RTC_PPM_CTL_TAMPPRIP: Tamper privilege protection (excluding backup registers)
      \arg        RTC_PPM_CTL_CALCPRIP: Shift register, daylight saving, calibration and reference clock privilege protection
      \arg        RTC_PPM_CTL_INITPRIP: Initialization privilege protection
      \arg        RTC_PPM_CTL_RTCPRIP: RTC privilege protection
      \arg        RTC_PPM_CTL_BKPRWPRIP: backup registers zone a privilege protection
      \arg        RTC_PPM_CTL_BKPWPRIP: backup registers zone b privilege protection
    \param[out] none
    \retval     none
*/
void rtc_pri_pro_disable(uint32_t sub_area)
{
    RTC_PPM_CTL &= (uint32_t)~(sub_area & RTC_PRI_PRO_MASK);
}

/*!
    \brief      enable RTC secure protection mode (API_ID(0x002AU))
    \param[in]  sub_area: specify which sub area of the RTC module to be protected by the secure mode
      \arg        RTC_SPM_CTL_ALRM0SECP: Alarm 0 secure protection
      \arg        RTC_SPM_CTL_ALRM1SECP: Alarm 1 secure protection
      \arg        RTC_SPM_CTL_WUTSECP: Wakeup timer secure  protection
      \arg        RTC_SPM_CTL_TSSECP: Timestamp secure protection
      \arg        RTC_SPM_CTL_TAMPSECP: Tamper secure protection (excluding backup registers)
      \arg        RTC_SPM_CTL_CALCSECP: Shift register, daylight saving, calibration and reference clock secure protection
      \arg        RTC_SPM_CTL_INITSECP: Initialization secure protection
      \arg        RTC_SPM_CTL_RTCSECP: RTC global secure protection
    \param[out] none
    \retval     none
*/
void rtc_sec_pro_enable(uint32_t sub_area)
{
    RTC_SPM_CTL |= (sub_area & RTC_SEC_PRO_MASK);
}

/*!
    \brief      disable RTC secure protection mode (API_ID(0x002BU))
    \param[in]  sub_area: specify which sub area of the RTC module to be removed from the protection of the secure mode
      \arg        RTC_SPM_CTL_ALRM0SECP: Alarm 0 protection
      \arg        RTC_SPM_CTL_ALRM1SECP:  Alarm 1 protection
      \arg        RTC_SPM_CTL_WUTSECP:  Wakeup timer protection
      \arg        RTC_SPM_CTL_TSSECP:  Timestamp protection
      \arg        RTC_SPM_CTL_TAMPSECP:  Tamper protection (excluding backup registers)
      \arg        RTC_SPM_CTL_CALCSECP:  Shift register, daylight saving, calibration and reference clock protection
      \arg        RTC_SPM_CTL_INITSECP:  Initialization protection
      \arg        RTC_SPM_CTL_RTCSECP:  RTC global protection
    \param[out] none
    \retval     none
*/
void rtc_sec_pro_disable(uint32_t sub_area)
{
    RTC_SPM_CTL &= (uint32_t)~(sub_area & RTC_SEC_PRO_MASK);
}

/*!
    \brief      set the RTC_BKP secure protection zonea tail value (API_ID(0x002CU))
    \param[in]  zonea_tail:RTC_BKP registers secure protection zonea
      \arg        RTC_BKP_PRO_ZONEA_TAIL_NONE: there is no RTC_BKP registers secure protection zonea
      \arg        RTC_BKP_PRO_ZONEA_TAIL_x(x = 0,1,2,...19):RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKPx,\
                                                            which can be read and written only when the APB is in secure mode
    \param[out] none
    \retval     none
*/
void rtc_bkp_zonea_sec_pro_set(uint32_t zonea_tail)
{
    RTC_SPM_CTL &= (uint32_t)~ RTC_SPM_CTL_BKPRWSECP;
    RTC_SPM_CTL |= (zonea_tail & RTC_SPM_CTL_BKPRWSECP_MASK);
}

/*!
    \brief      set the RTC_BKP secure protection zoneb tail value (API_ID(0x002DU))
    \param[in]  zoneb_tail:RTC_BKP registers secure protection zoneb
      \arg        RTC_BKP_PRO_ZONEB_TAIL_NONE: there is no RTC_BKP registers secure protection zoneb
      \arg        RTC_BKP_PRO_ZONEB_TAIL_x(x = 0,1,2,...19):the last RTC_BKP register of secure protection zoneb is RTC_BKPx,
                                                             if there is no RTC_BKP registers secure protection zoneb
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_bkp_zoneb_sec_pro_set(uint32_t zoneb_tail)
{
    ErrStatus error_status = ERROR;
    uint32_t zonea_tail = 0U;

    zonea_tail = GET_SPM_CTL_BKPRWSECP(RTC_SPM_CTL);
    RTC_SPM_CTL &= (uint32_t)~ RTC_SPM_CTL_BKPWSECP;
    RTC_SPM_CTL |= (zoneb_tail & RTC_SPM_CTL_BKPWSECP_MASK);

    zonea_tail = GET_SPM_CTL_BKPRWSECP(RTC_SPM_CTL);
    /* if zonea tail value is larger than or equal to the zoneb tail value, there is no zoneb.*/
    if(zonea_tail < zoneb_tail) {
        error_status = SUCCESS;
    }

    return error_status;
}

/*!
    \brief      check the RTC_BKP secure protection zoneb is valid or not (API_ID(0x002EU))
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_bkp_zoneb_sec_pro_check(void)
{
    ErrStatus error_status = ERROR;
    uint32_t zonea_tail = 0U;
    uint32_t zoneb_tail = 0U;

    zonea_tail = GET_SPM_CTL_BKPRWSECP(RTC_SPM_CTL);
    zoneb_tail = GET_SPM_CTL_BKPWSECP(RTC_SPM_CTL);
    /* if zonea tail value is larger than or equal to the zoneb tail value, there is no zoneb.*/
    if(zonea_tail < zoneb_tail) {
        error_status = SUCCESS;
    }
    return error_status;
}

/*!
    \brief      check specified flag (API_ID(0x002FU))
    \param[in]  flag: specify which flag to check
      \arg        RTC_FLAG_SCP: smooth calibration pending flag
      \arg        RTC_FLAG_TP1: RTC tamper 1 detected flag
      \arg        RTC_FLAG_TP0: RTC tamper 0 detected flag
      \arg        RTC_FLAG_TSOVR: time-stamp overflow flag
      \arg        RTC_FLAG_TS: time-stamp flag
      \arg        RTC_FLAG_ALARM0: alarm0 occurs flag
      \arg        RTC_FLAG_ALARM1: alarm1 occurs flag
      \arg        RTC_FLAG_WT: wakeup timer occurs flag
      \arg        RTC_FLAG_INIT: initialization state flag
      \arg        RTC_FLAG_RSYN: register synchronization flag
      \arg        RTC_FLAG_YCM: year configuration mark status flag
      \arg        RTC_FLAG_SOP: shift function operation pending flag
      \arg        RTC_FLAG_ALARM0W: alarm0 configuration can be written flag
      \arg        RTC_FLAG_ALARM1W: alarm1 configuration can be written flag
      \arg        RTC_FLAG_WTW: wakeup timer can be written flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rtc_flag_get(uint32_t flag)
{
    FlagStatus flag_state = RESET;
    if((flag & RTC_FLAG_ICSRM) == RTC_FLAG_ICSRM) {
        if((uint32_t)RESET != (RTC_ICS & flag)) {
            flag_state = SET;
        }
    } else {
        if((uint32_t)RESET != (RTC_STAT & flag)) {
            flag_state = SET;
        }
    }
    return flag_state;
}

/*!
    \brief      clear specified flag (API_ID(0x0030U))
    \param[in]  flag: specify which flag to clear
                one or more parameter can be selected which is shown as below:
      \arg        RTC_FLAG_TP1: RTC tamper 1 detected flag
      \arg        RTC_FLAG_TP0: RTC tamper 0 detected flag
      \arg        RTC_FLAG_TSOVR: time-stamp overflow flag
      \arg        RTC_FLAG_TS: time-stamp flag
      \arg        RTC_FLAG_WT: wakeup timer occurs flag
      \arg        RTC_FLAG_ALARM0: alarm0 occurs flag
      \arg        RTC_FLAG_ALARM1: alarm1 occurs flag
      \arg        RTC_FLAG_RSYN: register synchronization flag
    \param[out] none
    \retval     none
*/
void rtc_flag_clear(uint32_t flag)
{
    if((flag & RTC_FLAG_ICSRM) == RTC_FLAG_ICSRM) {
        /* RSYNF bit is also can be cleared by software writing 0 */
        RTC_ICS &= (uint32_t)(~flag);
    } else {
        /* Writing 1 in a bit clears the corresponding bit in the RTC_STAT register. */
        RTC_STATC |= flag;
    }
}

/*!
    \brief      enable specified RTC interrupt (API_ID(0x0031U))
    \param[in]  interrupt: specify which interrupt source to be enabled
                one or more parameter can be selected which is shown as below:
      \arg        RTC_INT_TIMESTAMP: timestamp interrupt
      \arg        RTC_INT_ALARM0: alarm0 interrupt
      \arg        RTC_INT_ALARM1: alarm1 interrupt
      \arg        RTC_INT_TAMP: tamper detection interrupt
      \arg        RTC_INT_WAKEUP: wakeup timer interrupt
    \param[out] none
    \retval     none
*/
void rtc_interrupt_enable(uint32_t interrupt)
{
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    /* enable the interrupts in RTC_CTL register */
    RTC_CTL |= (uint32_t)(interrupt & (uint32_t)~RTC_TAMP_TPIE);
    /* enable the interrupts in RTC_TAMP register */
    RTC_TAMP |= (uint32_t)(interrupt & RTC_TAMP_TPIE);

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}

/*!
    \brief      disable specified RTC interrupt (API_ID(0x0032U))
    \param[in]  interrupt: specify which interrupt source to be disabled
                one or more parameter can be selected which is shown as below:
      \arg        RTC_INT_TIMESTAMP: timestamp interrupt
      \arg        RTC_INT_ALARM0: alarm0 interrupt
      \arg        RTC_INT_ALARM1: alarm1 interrupt
      \arg        RTC_INT_TAMP: tamper detection interrupt
      \arg        RTC_INT_WAKEUP: wakeup timer interrupt
    \param[out] none
    \retval     none
*/
void rtc_interrupt_disable(uint32_t interrupt)
{
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    /* disable the interrupts in RTC_CTL register */
    RTC_CTL &= (uint32_t)~(interrupt & (uint32_t)~RTC_TAMP_TPIE);
    /* disable the interrupts in RTC_TAMP register */
    RTC_TAMP &= (uint32_t)~(interrupt & RTC_TAMP_TPIE);

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}

/*!
    \brief      get specified non-secure interrupt flag (API_ID(0x0033U))
    \param[in]  int_flag: specify which flag to check
                one or more parameter can be selected which is shown as below:
      \arg        RTC_NSMI_STAT_ALRM0NSMF: alarm0 non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_ALRM1NSMF: alarm1 non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_WTNSMF: wakeup timer non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TSNSMF: time-stamp non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TSOVRNSMF: Time-stamp overflow non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TP0NSMF: RTC_TAMP0 non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TP1NSMF: RTC_TAMP1 non-secure interrupt masked flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rtc_nsec_interrupt_flag_get(uint32_t int_flag)
{
    FlagStatus flag_state = RESET;
    if((uint32_t)RESET != (RTC_NSMI_STAT & int_flag)) {
        flag_state = SET;
    }
    return flag_state;
}

/*!
    \brief      clear specified non-secure interrupt flag (API_ID(0x0034U))
    \param[in]  int_flag: specify which flag to clear
                one or more parameter can be selected which is shown as below:
      \arg        RTC_NSMI_STAT_ALRM0NSMF: alarm0 non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_ALRM1NSMF: alarm1 non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_WTNSMF: wakeup timer non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TSNSMF: time-stamp non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TSOVRNSMF: Time-stamp overflow non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TP0NSMF: RTC_TAMP0 non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TP1NSMF: RTC_TAMP1 non-secure interrupt masked flag
    \param[out] none
    \retval     none
*/
void rtc_nsec_interrupt_flag_clear(uint32_t int_flag)
{
    /* Writing 1 in a bit clears the corresponding bit in the RTC_NSMI_STAT register. */
    RTC_STATC |= int_flag;
}

/*!
    \brief      get specified secure interrupt flag (API_ID(0x0035U))
    \param[in]  int_flag: specify which flag to check
                one or more parameter can be selected which is shown as below:
      \arg        RTC_SMI_STAT_ALRM0SMF: alarm0 secure interrupt masked flag
      \arg        RTC_SMI_STAT_ALRM1SMF: alarm1 secure interrupt masked flag
      \arg        RTC_SMI_STAT_WTSMF: wakeup timer secure interrupt masked flag
      \arg        RTC_SMI_STAT_TSSMF: time-stamp secure interrupt masked flag
      \arg        RTC_SMI_STAT_TSOVRSMF: Time-stamp overflow secure interrupt masked flag
      \arg        RTC_SMI_STAT_TP0SMF: RTC_TAMP0 secure interrupt masked flag
      \arg        RTC_SMI_STAT_TP1SMF: RTC_TAMP1 secure interrupt masked flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rtc_sec_interrupt_flag_get(uint32_t int_flag)
{
    FlagStatus flag_state = RESET;
    if((uint32_t)RESET != (RTC_SMI_STAT & int_flag)) {
        flag_state = SET;
    }
    return flag_state;
}

/*!
    \brief      clear specified secure interrupt flag (API_ID(0x0036U))
    \param[in]  int_flag: specify which flag to clear
                one or more parameter can be selected which is shown as below:
      \arg        RTC_SMI_STAT_ALRM0SMF: alarm0 secure interrupt masked flag
      \arg        RTC_SMI_STAT_ALRM1SMF: alarm1 secure interrupt masked flag
      \arg        RTC_SMI_STAT_WTSMF: wakeup timer secure interrupt masked flag
      \arg        RTC_SMI_STAT_TSSMF: time-stamp secure interrupt masked flag
      \arg        RTC_SMI_STAT_TSOVRSMF: Time-stamp overflow secure interrupt masked flag
      \arg        RTC_SMI_STAT_TP0SMF: RTC_TAMP0 secure interrupt masked flag
      \arg        RTC_SMI_STAT_TP1SMF: RTC_TAMP1 secure interrupt masked flag
    \param[out] none
    \retval     none
*/
void rtc_sec_interrupt_flag_clear(uint32_t int_flag)
{
    /* Writing 1 in a bit clears the corresponding bit in the RTC_SMI_STAT register. */
    RTC_STATC |= int_flag;
}